#Задани:

**№1**
Задача **“Установка Visual Studio”**

Просмотрев лекцию по установке Visual Studio попробуйте повторить установку. 
Для сдачи задачи требуется сделать скриншот кода консольной программы, который генерируется при запуске, но вместо “Hello, world” запишите строку “ЯЮниор”.

**№2**
Задача **"Переменные"**

Попрактикуйтесь в создании переменных, объявить 10 переменных разных типов.
Напоминание: переменные именуются с маленькой буквы, если название состоит из нескольких слов, то комбинируем их следующим образом - названиеПеременной.
Также имя всегда должно отражать суть того, что хранит переменная.

**№3**
Задача **"Что выведется в консоль и почему?"**

int a = 10;
int b = 38;
int c = (31 – 5 * a) / b;
Console.WriteLine(c);

ВАЖНО!!! Не запускать код и попытаться подумать головой. Также надо написать ответ “Почему?”

**№4**
Задача **"Работа со строками"**

Вы задаете вопросы пользователю, по типу "как вас зовут", "какой ваш знак зодиака" и тд, после чего, по данным, которые он ввел, формируете небольшой текст о пользователе.

К примеру: "Вас зовут Алексей, вам 21 год, вы водолей и работаете на заводе."

**№5**
Задача **"Перестановка местами значений"**

Даны две переменные. 
Поменять местами значения двух переменных. 
Вывести на экран значения переменных до перестановки и после.
К примеру, есть две переменные имя и фамилия, они сразу инициализированные, но данные не верные, перепутанные. Вот эти данные и надо поменять местами через код.

**№6**
Задача **"Картинки"**

На экране, в специальной зоне, выводятся картинки, по 3 в ряд. Всего у пользователя в альбоме 52 картинки. Код должен вывести, сколько полностью заполненных рядов можно будет вывести, и сколько картинок будет сверх меры.
В качестве решения ожидаются объявленные переменные с необходимыми значениями и, основываясь на значениях переменных, вывод необходимых данных.

**№7**
Задача **"Магазин"**

Легенда:
Вы приходите в магазин и хотите купить за своё золото кристаллы. В вашем кошельке есть какое-то количество золота, продавец спрашивает у вас, сколько кристаллов вы хотите купить? После сделки у вас остаётся какое-то количество золота и появляется какое-то количество кристаллов.
Формально:
При старте программы пользователь вводит начальное количество золота. Потом ему предлагается купить какое-то количество кристаллов по цене N(задать в программе самому). Пользователь вводит число и его золото конвертируется в кристаллы. Остаток золота и кристаллов выводится на экран.
Проверять на то, что у игрока достаточно денег не нужно.

**№8**
Задача **"Поликлиника"**

Вы заходите в поликлинику и видите огромную очередь из старушек, вам нужно рассчитать время ожидания в очереди.
Формально:
Пользователь вводит кол-во людей в очереди.
Фиксированное время приема одного человека всегда равно 10 минутам.
Пример ввода: Введите кол-во старушек: 14
Пример вывода: "Вы должны отстоять в очереди 2 часа и 20 минут."

**№9** Задача ** 
При помощи циклов вы можете повторять один и тот же код множество раз. 

Напишите простейшую программу, которая выводит указанное(установленное) пользователем сообщение
заданное количество раз. Количество повторов также должен ввести пользователь.

**№10** Задача **
Написать программу, которая будет выполняться до тех пор, пока не будет введено слово exit. 
Помните, в цикле должно быть условие, которое отвечает за то, когда цикл должен завершиться. 
Это нужно, чтобы любой разработчик взглянув на ваш код, понял четкие границы вашего цикла.

**№11** Задача **
Нужно написать программу (используя циклы, обязательно пояснить выбор вашего цикла), чтобы она
выводила следующую последовательность 5 12 19 26 33 40 47 54 61 68 75 82 89 96 
Нужны переменные для обозначения чисел в условии цикла.

**№12** Задача **
С помощью Random получить число number, которое не больше 100. Найти сумму всех положительных чисел меньше number (включая число), которые кратные 3 или 5. (К примеру, это числа 3, 5, 6, 9, 10, 12, 15 и т.д.)
